[
  {
    "text": "Many lack originality in their lack of originality.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not lazy, I’m just on energy-saving mode.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "Behind every great man is a woman rolling her eyes.",
    "author": "Jim Carrey",
    "category": "Humor"
  },
  {
    "text": "I’m not arguing, I’m just explaining why I’m right.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad handwriting, I have my own font.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "Life is short. Smile while you still have teeth.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not clumsy, the floor just loves me too much.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I told my therapist I feel like nobody listens to me, and she said, 'Next, please!'",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m Batman, but have you ever seen me and Batman in the same room?",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "My wallet is like an onion: opening it makes me cry.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t need a hair stylist, my pillow gives me a new hairstyle every morning.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m on a whiskey diet. I’ve lost three days already.",
    "author": "Tommy Cooper",
    "category": "Humor"
  },
  {
    "text": "I used to think I was indecisive, but now I’m not too sure.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "My boss told me to have a good day, so I went home.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bucket list, but my to-do list is killing me.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not short, I’m just concentrated awesome.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I told my wife I wanted to be cremated. She made an appointment for Tuesday.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "The early bird gets the worm, but the second mouse gets the cheese.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not late, I’m just on my own time zone.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t trip, I do random gravity checks.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not fat, I’m just easier to see.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t snore, I dream I’m a chainsaw.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "Many lack originality in their lack of originality.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "My bed is a magical place where I suddenly remember everything I was supposed to do.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m old, but my birth certificate is in Roman numerals.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a midlife crisis, I’m just having a midlife nap.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not a complete idiot—some parts are missing.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t suffer from insanity, I enjoy every minute of it.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I told my wife she was shouting at me like I was deaf. She said, ‘I’M NOT SHOUTING!’",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not lazy, I’m just practicing for retirement.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a beer belly, I have a protective covering for my rock-hard abs.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not clumsy, it’s just the floor hates me, the tables and chairs are bullies, and the walls get in my way.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "My doctor told me to watch my drinking, so I’m drinking in front of a mirror.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m Wonder Woman, I’m just saying no one has ever seen me and Wonder Woman in the same room.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t go to the gym because my kitchen clock is always ticking.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not forgetful, I just have a lot of selective memory.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I told my friend she drew her eyebrows too low. She looked disappointed.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m old, but my back goes out more than I do.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad temper, I just have a quick reaction to nonsense.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "My idea of a balanced diet is a cookie in each hand.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not procrastinating, I’m giving my ideas time to mature.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have grey hair, I have wisdom highlights.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m perfect, but I’m pretty close to awesome.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I told my wife I’d take her somewhere she’s never been before. She said, ‘How about the kitchen?’",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not messy, I’m just creatively disorganized.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with caffeine, I have a problem without it.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not ignoring you, I’m just prioritizing my daydreams.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t need a motivational speaker, I need coffee.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m Superman, but I’ve never been seen in the same room as Clark Kent.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a short attention span, I just—oh, look, a squirrel!",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not broke, I’m just pre-rich.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t get lost, I just take scenic detours.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a genius, but I did just figure out how to eat pizza for breakfast.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad memory, I just have a lot of thoughts competing for attention.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not arguing, I’m just passionately expressing my opinion.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t diet, I just eat according to my mood.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m old, but my joints are better at predicting the weather than the meteorologist.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with authority, I just have a problem with being told what to do.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a superhero, but I did save my couch from loneliness.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a messy room, I have an obstacle course.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m out of shape, but my running shoes are collecting dust bunnies.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad attitude, I just have a personality you can’t handle.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m forgetful, but I just remembered I forgot something.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with mornings, I just don’t think they should start so early.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a chef, but I can burn water like a pro.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t nap, I just take unscheduled power outages.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m lazy, but I’ve mastered the art of doing nothing.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad day, I just have a day with extra character-building moments.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a morning person, but I’m awake when the coffee kicks in.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with technology, I just have a problem with it not doing what I want.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a couch potato, but my TV remote is my best friend.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad sense of direction, I just explore alternative routes.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a slob, but my room is an ecosystem for dust bunnies.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with exercise, I just prefer to exercise my right to relax.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m disorganized, but my chaos has its own charm.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad memory, I just have a lot of mental spam.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a night owl, but I do my best thinking when the stars are out.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with diets, I just think calories are hugs from food.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a procrastinator, but I’ll finish this list tomorrow.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad temper, I just have a low tolerance for nonsense.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a klutz, but I trip over my own confidence.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with mornings, I just think they should come with a snooze button.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m forgetful, but I walked into a room and forgot why I was there.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad diet, I just believe in equal opportunity for all food groups.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m out of shape, but my yoga pose is called ‘couch potato.’",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with authority, I just think I’d be a better boss.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a genius, but I did solve the puzzle of how to eat dessert first.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a messy desk, I have a creative workspace.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m clumsy, but I’ve had a few unscheduled meetings with the floor.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with technology, I just think it has a problem with me.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m lazy, but I’ve got a black belt in lounging.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad memory, I just have a lot of thoughts on vacation.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a morning person, but I’m awake when the coffee says so.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with exercise, I just think my couch needs me more.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a procrastinator, but I’ll deal with that later.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad attitude, I just have a personality that’s too big for this room.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m old, but my idea of a wild night is staying up past 9 p.m.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "My internet is so slow, it’s just faster to drive to the Google headquarters and ask them in person.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad memory, I just have a hard drive that’s full.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I told my boss I needed a raise because I’m so inflated with responsibilities.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a genius, but I did just figure out how to open a pickle jar.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t snore, I’m just practicing for the grumpy cat audition.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not lazy, I’m just conserving my energy for the zombie apocalypse.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "My exercise routine consists of running out of excuses.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a short fuse, I just have a quick spark.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m old, but my birthday candles cost more than the cake.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a messy car, I just have an archaeological dig on wheels.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m out of shape, but my treadmill is now a clothes rack.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad diet, I’m just taste-testing the entire food pyramid.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I told my wife I wanted to try something new. She suggested doing the dishes.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not clumsy, I’m just testing the durability of everything around me.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with mornings, I just think they start too early.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a chef, but I can make cereal with the best of them.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad attention span, I just—oh, look, a shiny thing!",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m forgetful, but I just walked into the kitchen and forgot why.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a beer belly, I have a liquid grain storage facility.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a morning person, but I’m awake when my coffee says so.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with technology, I just think it’s plotting against me.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m disorganized, but my sock drawer is staging a rebellion.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad temper, I just have a low tolerance for stupidity.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a couch potato, but my remote control is my life coach.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with exercise, I just prefer to exercise my right to chill.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a klutz, but I’ve tripped over my own ego more than once.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad sense of direction, I just like to explore the scenic route.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m broke, but my bank account is practicing for the minimalist trend.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a messy desk, I have a creative chaos zone.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a night owl, but I do my best work when the moon’s out.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with diets, I just think food deserves to be loved.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a procrastinator, but I’ll finish this sentence later.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad attitude, I just have a personality that’s too spicy for some.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m old, but my knees sound like a bowl of Rice Krispies.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with mornings, I just think they should come with a warning label.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a chef, but I can microwave like a pro.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad memory, I just have a lot of thoughts on sabbatical.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m out of shape, but my fitness goal is to survive the stairs.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with authority, I just think I’d be a better dictator.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a genius, but I did just solve the mystery of the missing sock.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a messy room, I have an avant-garde interior design.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m clumsy, but I’ve had a few unscheduled floor inspections.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with technology, I just think my computer has trust issues.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m lazy, but I’ve perfected the art of strategic lounging.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad diet, I just believe in equal opportunity for all snacks.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m forgetful, but I just forgot what I was going to say.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with exercise, I just think my couch is more supportive.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a morning person, but I’m awake when the caffeine kicks in.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad temper, I just have a quick wit with a short fuse.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a couch potato, but my Netflix queue is my life’s work.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad sense of direction, I just like to take the long way home.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m broke, but my piggy bank just filed for bankruptcy.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a messy car, I just have a mobile storage unit.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m out of shape, but my yoga pose is called ‘napping savasana.’",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with diets, I just think calories are tiny hugs.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a procrastinator, but I’ll get back to you on that.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad attitude, I just have a personality that’s too big for this meeting.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m old, but my idea of a wild night is finishing a book.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with mornings, I just think they should start at noon.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a chef, but I can toast bread like nobody’s business.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad memory, I just have a lot of thoughts on vacation.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m out of shape, but my fitness tracker just sent me a sympathy card.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with authority, I just think rules are suggestions.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a genius, but I did just figure out how to eat dessert for breakfast.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a messy desk, I have a curated collection of chaos.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m clumsy, but I’ve had a few unscheduled meetings with gravity.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with technology, I just think my phone has a personal vendetta.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m lazy, but I’ve got a PhD in chilling.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad diet, I just believe in celebrating food daily.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m forgetful, but I just forgot where I parked my brain.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with exercise, I just think my sofa needs me more.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a morning person, but I’m awake when the coffee shop opens.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad temper, I just have a quick reaction to nonsense.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a couch potato, but my TV is my best therapist.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad sense of direction, I just like to discover new dead ends.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m broke, but my wallet just sent me an eviction notice.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a messy room, I have a creative masterpiece in progress.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m out of shape, but my running shoes are on permanent vacation.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with diets, I just think food is my love language.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a procrastinator, but I’ll deal with it tomorrow.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad attitude, I just have a personality that’s too fabulous for this room.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m old, but my idea of a party is a nap and a good book.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with mornings, I just think they should come with a mute button.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a chef, but I can make a mean bowl of cereal.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad memory, I just have a lot of thoughts on a coffee break.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m out of shape, but my gym membership is just for show.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with authority, I just think I’m the real boss.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a genius, but I did just figure out how to avoid doing dishes.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a messy desk, I have a work of art in chaos.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m clumsy, but I’ve had a few unscheduled floor hugs.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with technology, I just think my laptop is staging a coup.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m lazy, but I’ve got a gold medal in lounging.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad diet, I just believe in giving all foods a fair chance.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m forgetful, but I just forgot what I was thinking about.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a problem with exercise, I just think my couch is my personal trainer.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a morning person, but I’m awake when the coffee’s ready.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad temper, I just have a quick wit with a short leash.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I’m not saying I’m a couch potato, but my streaming service knows me better than my friends.",
    "author": "Unknown",
    "category": "Humor"
  },
  {
    "text": "I don’t have a bad sense of direction, I just like to take the adventure route.",
    "author": "Unknown",
    "category": "Humor"
  }
]
